# Кожен Конкретний_Компонент повинен реалізувати метод accept таким чином,
# щоб він викликав метод відвідувача, який відповідає класу компонента
require "./Component/Component"

class ConcreteComponentA < Component

  # Викликаємо visitConcreteComponentA, що відповідає назві поточного класу.
  # Таким чином, ми дозволяємо відвідувачу дізнатися, з яким класом компонента він працює.
  def accept(visitor)
    visitor.visit_concrete_component_a(self)
  end

  # Конкретні компоненти можуть мати спеціальні методи, не оголошені в їхньому базовому
  # класі або інтерфейсі. Відвідувач все ж таки може використовувати ці методи,
  # оскільки він знає про конкретний клас компонента.
  def exclusive_method_of_concrete_component_a
    "A"
  end
end